tap "homebrew/core"
tap "homebrew/bundle"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# nvim
brew "neovim", args: ["HEAD"]
brew "universal-ctags"

# shell
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
## git
brew "git"
brew "lazygit"
brew "git-delta"
## langs
brew "go"
brew "lua"
brew "nodejs"
brew "rustup-init"

## utils
brew "gh"
brew "git"
brew "lazygit"
brew "moreutils"
brew "gnupg"
brew "openssh"
brew "findutils"
brew "asdf"
brew "grep"
brew "grex"
brew "emacs"
brew "ripgrep"
brew "fd"
brew "bat"
brew "tree"
brew "gitmoji"
brew "bottom"
brew "jq"
brew "wget"
brew "tealdeer"
brew "tre"
brew "terraform"
brew "exa"
brew "tokei"
brew "sd"
brew "luacheck"
brew "docker"
brew "docker-buildx"
brew "colima"
brew "httpie"
brew "dog"

# terminal
cask "warp"

# apps
cask "raycast"
cask "discord"
cask "slack"
cask "spotify"
cask "hiddenbar"
cask "1password"
cask "betterdisplay"
cask "firefox"
cask "signal"
cask "mimestream"
cask "rectangle"
cask "loom"
cask "zoom"
cask "visual-studio-code"
cask "private-internet-access"
cask "plex"
cask "amethyst"

# fonts
cask "font-jetbrains-mono-nerd-font"
